---
kind: other
id: Methods.T:Autodesk.Revit.DB.DetailCurveArray
source: html/a7364af0-01cf-0660-ba71-f3dfee4968ff.htm
---
# DetailCurveArray Methods

Removes every item from the array, rendering it empty.